<?xml version="1.0"?>
<net name="onnx_Frontend_IR" version="11">
	<layers>
		<layer id="0" name="obs" type="Parameter" version="opset1">
			<data shape="1,49" element_type="f32" />
			<output>
				<port id="0" precision="FP32" names="obs">
					<dim>1</dim>
					<dim>49</dim>
				</port>
			</output>
		</layer>
		<layer id="1" name="Constant_2467" type="Const" version="opset1">
			<data element_type="f32" shape="1, 49" offset="0" size="196" />
			<output>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>49</dim>
				</port>
			</output>
		</layer>
		<layer id="2" name="Multiply_2451" type="Multiply" version="opset1">
			<data auto_broadcast="numpy" />
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>49</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>49</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32">
					<dim>1</dim>
					<dim>49</dim>
				</port>
			</output>
		</layer>
		<layer id="3" name="Constant_2468" type="Const" version="opset1">
			<data element_type="f32" shape="1, 49" offset="196" size="196" />
			<output>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>49</dim>
				</port>
			</output>
		</layer>
		<layer id="4" name="functional_1_1/truediv" type="Add" version="opset1">
			<data auto_broadcast="numpy" />
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>49</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>49</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="functional_1_1/truediv:0">
					<dim>1</dim>
					<dim>49</dim>
				</port>
			</output>
		</layer>
		<layer id="5" name="Transpose_2090" type="Const" version="opset1">
			<data element_type="f32" shape="512, 49" offset="392" size="100352" />
			<output>
				<port id="0" precision="FP32">
					<dim>512</dim>
					<dim>49</dim>
				</port>
			</output>
		</layer>
		<layer id="6" name="functional_1_1/MLP_0_1/hidden_0_1/MatMul_Gemm__6/WithoutBiases" type="MatMul" version="opset1">
			<data transpose_a="false" transpose_b="true" />
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>49</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>512</dim>
					<dim>49</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32">
					<dim>1</dim>
					<dim>512</dim>
				</port>
			</output>
		</layer>
		<layer id="7" name="Constant_2469" type="Const" version="opset1">
			<data element_type="f32" shape="1, 512" offset="100744" size="2048" />
			<output>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>512</dim>
				</port>
			</output>
		</layer>
		<layer id="8" name="functional_1_1/MLP_0_1/hidden_0_1/MatMul_Gemm__6" type="Add" version="opset1">
			<data auto_broadcast="numpy" />
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>512</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>512</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="functional_1_1/MLP_0_1/hidden_0_1/MatMul_Gemm__6:0">
					<dim>1</dim>
					<dim>512</dim>
				</port>
			</output>
		</layer>
		<layer id="9" name="functional_1_1/MLP_0_1/hidden_0_1/mul_1" type="Swish" version="opset4">
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>512</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32" names="functional_1_1/MLP_0_1/hidden_0_1/mul_1:0">
					<dim>1</dim>
					<dim>512</dim>
				</port>
			</output>
		</layer>
		<layer id="10" name="Transpose_2096" type="Const" version="opset1">
			<data element_type="f32" shape="256, 512" offset="102792" size="524288" />
			<output>
				<port id="0" precision="FP32">
					<dim>256</dim>
					<dim>512</dim>
				</port>
			</output>
		</layer>
		<layer id="11" name="functional_1_1/MLP_0_1/hidden_1_1/MatMul_Gemm__7/WithoutBiases" type="MatMul" version="opset1">
			<data transpose_a="false" transpose_b="true" />
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>512</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>256</dim>
					<dim>512</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32">
					<dim>1</dim>
					<dim>256</dim>
				</port>
			</output>
		</layer>
		<layer id="12" name="Constant_2470" type="Const" version="opset1">
			<data element_type="f32" shape="1, 256" offset="627080" size="1024" />
			<output>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>256</dim>
				</port>
			</output>
		</layer>
		<layer id="13" name="functional_1_1/MLP_0_1/hidden_1_1/MatMul_Gemm__7" type="Add" version="opset1">
			<data auto_broadcast="numpy" />
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>256</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>256</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="functional_1_1/MLP_0_1/hidden_1_1/MatMul_Gemm__7:0">
					<dim>1</dim>
					<dim>256</dim>
				</port>
			</output>
		</layer>
		<layer id="14" name="functional_1_1/MLP_0_1/hidden_1_1/mul_1" type="Swish" version="opset4">
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>256</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32" names="functional_1_1/MLP_0_1/hidden_1_1/mul_1:0">
					<dim>1</dim>
					<dim>256</dim>
				</port>
			</output>
		</layer>
		<layer id="15" name="Transpose_2102" type="Const" version="opset1">
			<data element_type="f32" shape="128, 256" offset="628104" size="131072" />
			<output>
				<port id="0" precision="FP32">
					<dim>128</dim>
					<dim>256</dim>
				</port>
			</output>
		</layer>
		<layer id="16" name="functional_1_1/MLP_0_1/hidden_2_1/MatMul_Gemm__8/WithoutBiases" type="MatMul" version="opset1">
			<data transpose_a="false" transpose_b="true" />
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>256</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>128</dim>
					<dim>256</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32">
					<dim>1</dim>
					<dim>128</dim>
				</port>
			</output>
		</layer>
		<layer id="17" name="Constant_2471" type="Const" version="opset1">
			<data element_type="f32" shape="1, 128" offset="759176" size="512" />
			<output>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>128</dim>
				</port>
			</output>
		</layer>
		<layer id="18" name="functional_1_1/MLP_0_1/hidden_2_1/MatMul_Gemm__8" type="Add" version="opset1">
			<data auto_broadcast="numpy" />
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>128</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>128</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="functional_1_1/MLP_0_1/hidden_2_1/MatMul_Gemm__8:0">
					<dim>1</dim>
					<dim>128</dim>
				</port>
			</output>
		</layer>
		<layer id="19" name="functional_1_1/MLP_0_1/hidden_2_1/mul_1" type="Swish" version="opset4">
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>128</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32" names="functional_1_1/MLP_0_1/hidden_2_1/mul_1:0">
					<dim>1</dim>
					<dim>128</dim>
				</port>
			</output>
		</layer>
		<layer id="20" name="Transpose_2108" type="Const" version="opset1">
			<data element_type="f32" shape="24, 128" offset="759688" size="12288" />
			<output>
				<port id="0" precision="FP32">
					<dim>24</dim>
					<dim>128</dim>
				</port>
			</output>
		</layer>
		<layer id="21" name="functional_1_1/MLP_0_1/hidden_3_1/MatMul_Gemm__9/WithoutBiases" type="MatMul" version="opset1">
			<data transpose_a="false" transpose_b="true" />
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>128</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>24</dim>
					<dim>128</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32">
					<dim>1</dim>
					<dim>24</dim>
				</port>
			</output>
		</layer>
		<layer id="22" name="Constant_2472" type="Const" version="opset1">
			<data element_type="f32" shape="1, 24" offset="771976" size="96" />
			<output>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>24</dim>
				</port>
			</output>
		</layer>
		<layer id="23" name="functional_1_1/MLP_0_1/hidden_3_1/MatMul_Gemm__9" type="Add" version="opset1">
			<data auto_broadcast="numpy" />
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>24</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>24</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="functional_1_1/MLP_0_1/hidden_3_1/MatMul_Gemm__9:0">
					<dim>1</dim>
					<dim>24</dim>
				</port>
			</output>
		</layer>
		<layer id="24" name="Constant_44" type="Const" version="opset1">
			<data element_type="i64" shape="" offset="772072" size="8" />
			<output>
				<port id="0" precision="I64" />
			</output>
		</layer>
		<layer id="25" name="functional_1_1/split" type="Split" version="opset1">
			<data num_splits="2" />
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>24</dim>
				</port>
				<port id="1" precision="I64" />
			</input>
			<output>
				<port id="2" precision="FP32" names="functional_1_1/split:0">
					<dim>1</dim>
					<dim>12</dim>
				</port>
				<port id="3" precision="FP32" names="functional_1_1/split:1">
					<dim>1</dim>
					<dim>12</dim>
				</port>
			</output>
		</layer>
		<layer id="26" name="action" type="Tanh" version="opset1">
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>12</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32" names="action">
					<dim>1</dim>
					<dim>12</dim>
				</port>
			</output>
		</layer>
		<layer id="27" name="action/sink_port_0" type="Result" version="opset1" output_names="action">
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>12</dim>
				</port>
			</input>
		</layer>
	</layers>
	<edges>
		<edge from-layer="0" from-port="0" to-layer="2" to-port="0" />
		<edge from-layer="1" from-port="0" to-layer="2" to-port="1" />
		<edge from-layer="2" from-port="2" to-layer="4" to-port="0" />
		<edge from-layer="3" from-port="0" to-layer="4" to-port="1" />
		<edge from-layer="4" from-port="2" to-layer="6" to-port="0" />
		<edge from-layer="5" from-port="0" to-layer="6" to-port="1" />
		<edge from-layer="6" from-port="2" to-layer="8" to-port="0" />
		<edge from-layer="7" from-port="0" to-layer="8" to-port="1" />
		<edge from-layer="8" from-port="2" to-layer="9" to-port="0" />
		<edge from-layer="9" from-port="1" to-layer="11" to-port="0" />
		<edge from-layer="10" from-port="0" to-layer="11" to-port="1" />
		<edge from-layer="11" from-port="2" to-layer="13" to-port="0" />
		<edge from-layer="12" from-port="0" to-layer="13" to-port="1" />
		<edge from-layer="13" from-port="2" to-layer="14" to-port="0" />
		<edge from-layer="14" from-port="1" to-layer="16" to-port="0" />
		<edge from-layer="15" from-port="0" to-layer="16" to-port="1" />
		<edge from-layer="16" from-port="2" to-layer="18" to-port="0" />
		<edge from-layer="17" from-port="0" to-layer="18" to-port="1" />
		<edge from-layer="18" from-port="2" to-layer="19" to-port="0" />
		<edge from-layer="19" from-port="1" to-layer="21" to-port="0" />
		<edge from-layer="20" from-port="0" to-layer="21" to-port="1" />
		<edge from-layer="21" from-port="2" to-layer="23" to-port="0" />
		<edge from-layer="22" from-port="0" to-layer="23" to-port="1" />
		<edge from-layer="23" from-port="2" to-layer="25" to-port="0" />
		<edge from-layer="24" from-port="0" to-layer="25" to-port="1" />
		<edge from-layer="25" from-port="2" to-layer="26" to-port="0" />
		<edge from-layer="26" from-port="1" to-layer="27" to-port="0" />
	</edges>
	<rt_info>
		<Runtime_version value="2026.1.0-21367-63e31528c62-releases/2026/1" />
		<conversion_parameters>
			<input_model value="DIR/policy.onnx" />
			<is_python_object value="False" />
		</conversion_parameters>
	</rt_info>
</net>
