<?xml version="1.0"?>
<net name="onnx_Frontend_IR" version="11">
	<layers>
		<layer id="0" name="obs" type="Parameter" version="opset1">
			<data shape="1,69" element_type="f32" />
			<output>
				<port id="0" precision="FP32" names="obs">
					<dim>1</dim>
					<dim>69</dim>
				</port>
			</output>
		</layer>
		<layer id="1" name="Constant_273_compressed" type="Const" version="opset1">
			<data element_type="f16" shape="1, 69" offset="0" size="138" />
			<output>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>69</dim>
				</port>
			</output>
		</layer>
		<layer id="2" name="Constant_273" type="Convert" version="opset1">
			<data destination_type="f32" />
			<rt_info>
				<attribute name="decompression" version="0" />
			</rt_info>
			<input>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>69</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>69</dim>
				</port>
			</output>
		</layer>
		<layer id="3" name="Multiply_2351" type="Multiply" version="opset1">
			<data auto_broadcast="numpy" />
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>69</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>69</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32">
					<dim>1</dim>
					<dim>69</dim>
				</port>
			</output>
		</layer>
		<layer id="4" name="Constant_2353_compressed" type="Const" version="opset1">
			<data element_type="f16" shape="1, 69" offset="138" size="138" />
			<output>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>69</dim>
				</port>
			</output>
		</layer>
		<layer id="5" name="Constant_2353" type="Convert" version="opset1">
			<data destination_type="f32" />
			<rt_info>
				<attribute name="decompression" version="0" />
			</rt_info>
			<input>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>69</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>69</dim>
				</port>
			</output>
		</layer>
		<layer id="6" name="/obs_normalizer/Div" type="Add" version="opset1">
			<data auto_broadcast="numpy" />
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>69</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>69</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="/obs_normalizer/Div_output_0">
					<dim>1</dim>
					<dim>69</dim>
				</port>
			</output>
		</layer>
		<layer id="7" name="mlp.0.weight_compressed" type="Const" version="opset1">
			<data element_type="f16" shape="512, 69" offset="276" size="70656" />
			<output>
				<port id="0" precision="FP16" names="mlp.0.weight">
					<dim>512</dim>
					<dim>69</dim>
				</port>
			</output>
		</layer>
		<layer id="8" name="mlp.0.weight" type="Convert" version="opset1">
			<data destination_type="f32" />
			<rt_info>
				<attribute name="decompression" version="0" />
			</rt_info>
			<input>
				<port id="0" precision="FP16">
					<dim>512</dim>
					<dim>69</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32">
					<dim>512</dim>
					<dim>69</dim>
				</port>
			</output>
		</layer>
		<layer id="9" name="/mlp/mlp.0/Gemm/WithoutBiases" type="MatMul" version="opset1">
			<data transpose_a="false" transpose_b="true" />
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>69</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>512</dim>
					<dim>69</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32">
					<dim>1</dim>
					<dim>512</dim>
				</port>
			</output>
		</layer>
		<layer id="10" name="Constant_2363_compressed" type="Const" version="opset1">
			<data element_type="f16" shape="1, 512" offset="70932" size="1024" />
			<output>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>512</dim>
				</port>
			</output>
		</layer>
		<layer id="11" name="Constant_2363" type="Convert" version="opset1">
			<data destination_type="f32" />
			<rt_info>
				<attribute name="decompression" version="0" />
			</rt_info>
			<input>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>512</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>512</dim>
				</port>
			</output>
		</layer>
		<layer id="12" name="/mlp/mlp.0/Gemm" type="Add" version="opset1">
			<data auto_broadcast="numpy" />
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>512</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>512</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="/mlp/mlp.0/Gemm_output_0">
					<dim>1</dim>
					<dim>512</dim>
				</port>
			</output>
		</layer>
		<layer id="13" name="/mlp/mlp.1/Elu" type="Elu" version="opset1">
			<data alpha="1" />
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>512</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32" names="/mlp/mlp.1/Elu_output_0">
					<dim>1</dim>
					<dim>512</dim>
				</port>
			</output>
		</layer>
		<layer id="14" name="mlp.2.weight_compressed" type="Const" version="opset1">
			<data element_type="f16" shape="256, 512" offset="71956" size="262144" />
			<output>
				<port id="0" precision="FP16" names="mlp.2.weight">
					<dim>256</dim>
					<dim>512</dim>
				</port>
			</output>
		</layer>
		<layer id="15" name="mlp.2.weight" type="Convert" version="opset1">
			<data destination_type="f32" />
			<rt_info>
				<attribute name="decompression" version="0" />
			</rt_info>
			<input>
				<port id="0" precision="FP16">
					<dim>256</dim>
					<dim>512</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32">
					<dim>256</dim>
					<dim>512</dim>
				</port>
			</output>
		</layer>
		<layer id="16" name="/mlp/mlp.2/Gemm/WithoutBiases" type="MatMul" version="opset1">
			<data transpose_a="false" transpose_b="true" />
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>512</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>256</dim>
					<dim>512</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32">
					<dim>1</dim>
					<dim>256</dim>
				</port>
			</output>
		</layer>
		<layer id="17" name="Constant_2364_compressed" type="Const" version="opset1">
			<data element_type="f16" shape="1, 256" offset="334100" size="512" />
			<output>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>256</dim>
				</port>
			</output>
		</layer>
		<layer id="18" name="Constant_2364" type="Convert" version="opset1">
			<data destination_type="f32" />
			<rt_info>
				<attribute name="decompression" version="0" />
			</rt_info>
			<input>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>256</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>256</dim>
				</port>
			</output>
		</layer>
		<layer id="19" name="/mlp/mlp.2/Gemm" type="Add" version="opset1">
			<data auto_broadcast="numpy" />
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>256</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>256</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="/mlp/mlp.2/Gemm_output_0">
					<dim>1</dim>
					<dim>256</dim>
				</port>
			</output>
		</layer>
		<layer id="20" name="/mlp/mlp.1_1/Elu" type="Elu" version="opset1">
			<data alpha="1" />
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>256</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32" names="/mlp/mlp.1_1/Elu_output_0">
					<dim>1</dim>
					<dim>256</dim>
				</port>
			</output>
		</layer>
		<layer id="21" name="mlp.4.weight_compressed" type="Const" version="opset1">
			<data element_type="f16" shape="128, 256" offset="334612" size="65536" />
			<output>
				<port id="0" precision="FP16" names="mlp.4.weight">
					<dim>128</dim>
					<dim>256</dim>
				</port>
			</output>
		</layer>
		<layer id="22" name="mlp.4.weight" type="Convert" version="opset1">
			<data destination_type="f32" />
			<rt_info>
				<attribute name="decompression" version="0" />
			</rt_info>
			<input>
				<port id="0" precision="FP16">
					<dim>128</dim>
					<dim>256</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32">
					<dim>128</dim>
					<dim>256</dim>
				</port>
			</output>
		</layer>
		<layer id="23" name="/mlp/mlp.4/Gemm/WithoutBiases" type="MatMul" version="opset1">
			<data transpose_a="false" transpose_b="true" />
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>256</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>128</dim>
					<dim>256</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32">
					<dim>1</dim>
					<dim>128</dim>
				</port>
			</output>
		</layer>
		<layer id="24" name="Constant_2365_compressed" type="Const" version="opset1">
			<data element_type="f16" shape="1, 128" offset="400148" size="256" />
			<output>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>128</dim>
				</port>
			</output>
		</layer>
		<layer id="25" name="Constant_2365" type="Convert" version="opset1">
			<data destination_type="f32" />
			<rt_info>
				<attribute name="decompression" version="0" />
			</rt_info>
			<input>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>128</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>128</dim>
				</port>
			</output>
		</layer>
		<layer id="26" name="/mlp/mlp.4/Gemm" type="Add" version="opset1">
			<data auto_broadcast="numpy" />
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>128</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>128</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="/mlp/mlp.4/Gemm_output_0">
					<dim>1</dim>
					<dim>128</dim>
				</port>
			</output>
		</layer>
		<layer id="27" name="/mlp/mlp.1_2/Elu" type="Elu" version="opset1">
			<data alpha="1" />
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>128</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32" names="/mlp/mlp.1_2/Elu_output_0">
					<dim>1</dim>
					<dim>128</dim>
				</port>
			</output>
		</layer>
		<layer id="28" name="mlp.6.weight_compressed" type="Const" version="opset1">
			<data element_type="f16" shape="20, 128" offset="400404" size="5120" />
			<output>
				<port id="0" precision="FP16" names="mlp.6.weight">
					<dim>20</dim>
					<dim>128</dim>
				</port>
			</output>
		</layer>
		<layer id="29" name="mlp.6.weight" type="Convert" version="opset1">
			<data destination_type="f32" />
			<rt_info>
				<attribute name="decompression" version="0" />
			</rt_info>
			<input>
				<port id="0" precision="FP16">
					<dim>20</dim>
					<dim>128</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32">
					<dim>20</dim>
					<dim>128</dim>
				</port>
			</output>
		</layer>
		<layer id="30" name="/mlp/mlp.6/Gemm/WithoutBiases" type="MatMul" version="opset1">
			<data transpose_a="false" transpose_b="true" />
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>128</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>20</dim>
					<dim>128</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32">
					<dim>1</dim>
					<dim>20</dim>
				</port>
			</output>
		</layer>
		<layer id="31" name="Constant_2366_compressed" type="Const" version="opset1">
			<data element_type="f16" shape="1, 20" offset="405524" size="40" />
			<output>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>20</dim>
				</port>
			</output>
		</layer>
		<layer id="32" name="Constant_2366" type="Convert" version="opset1">
			<data destination_type="f32" />
			<rt_info>
				<attribute name="decompression" version="0" />
			</rt_info>
			<input>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>20</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>20</dim>
				</port>
			</output>
		</layer>
		<layer id="33" name="actions" type="Add" version="opset1">
			<data auto_broadcast="numpy" />
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>20</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>20</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="actions">
					<dim>1</dim>
					<dim>20</dim>
				</port>
			</output>
		</layer>
		<layer id="34" name="actions/sink_port_0" type="Result" version="opset1" output_names="actions">
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>20</dim>
				</port>
			</input>
		</layer>
	</layers>
	<edges>
		<edge from-layer="0" from-port="0" to-layer="3" to-port="0" />
		<edge from-layer="1" from-port="0" to-layer="2" to-port="0" />
		<edge from-layer="2" from-port="1" to-layer="3" to-port="1" />
		<edge from-layer="3" from-port="2" to-layer="6" to-port="0" />
		<edge from-layer="4" from-port="0" to-layer="5" to-port="0" />
		<edge from-layer="5" from-port="1" to-layer="6" to-port="1" />
		<edge from-layer="6" from-port="2" to-layer="9" to-port="0" />
		<edge from-layer="7" from-port="0" to-layer="8" to-port="0" />
		<edge from-layer="8" from-port="1" to-layer="9" to-port="1" />
		<edge from-layer="9" from-port="2" to-layer="12" to-port="0" />
		<edge from-layer="10" from-port="0" to-layer="11" to-port="0" />
		<edge from-layer="11" from-port="1" to-layer="12" to-port="1" />
		<edge from-layer="12" from-port="2" to-layer="13" to-port="0" />
		<edge from-layer="13" from-port="1" to-layer="16" to-port="0" />
		<edge from-layer="14" from-port="0" to-layer="15" to-port="0" />
		<edge from-layer="15" from-port="1" to-layer="16" to-port="1" />
		<edge from-layer="16" from-port="2" to-layer="19" to-port="0" />
		<edge from-layer="17" from-port="0" to-layer="18" to-port="0" />
		<edge from-layer="18" from-port="1" to-layer="19" to-port="1" />
		<edge from-layer="19" from-port="2" to-layer="20" to-port="0" />
		<edge from-layer="20" from-port="1" to-layer="23" to-port="0" />
		<edge from-layer="21" from-port="0" to-layer="22" to-port="0" />
		<edge from-layer="22" from-port="1" to-layer="23" to-port="1" />
		<edge from-layer="23" from-port="2" to-layer="26" to-port="0" />
		<edge from-layer="24" from-port="0" to-layer="25" to-port="0" />
		<edge from-layer="25" from-port="1" to-layer="26" to-port="1" />
		<edge from-layer="26" from-port="2" to-layer="27" to-port="0" />
		<edge from-layer="27" from-port="1" to-layer="30" to-port="0" />
		<edge from-layer="28" from-port="0" to-layer="29" to-port="0" />
		<edge from-layer="29" from-port="1" to-layer="30" to-port="1" />
		<edge from-layer="30" from-port="2" to-layer="33" to-port="0" />
		<edge from-layer="31" from-port="0" to-layer="32" to-port="0" />
		<edge from-layer="32" from-port="1" to-layer="33" to-port="1" />
		<edge from-layer="33" from-port="2" to-layer="34" to-port="0" />
	</edges>
	<rt_info>
		<Runtime_version value="2026.0.0-20965-c6d6a13a886-releases/2026/0" />
		<conversion_parameters>
			<input_model value="DIR/policy.onnx" />
			<is_python_object value="False" />
		</conversion_parameters>
	</rt_info>
</net>
