<?xml version="1.0"?>
<net name="tf2onnx" version="11">
	<layers>
		<layer id="0" name="waveform" type="Parameter" version="opset1">
			<data shape="?" element_type="f32" />
			<output>
				<port id="0" precision="FP32" names="waveform">
					<dim>-1</dim>
				</port>
			</output>
		</layer>
		<layer id="1" name="cst_rfft_512__56_compressed" type="Const" version="opset1">
			<data element_type="f16" shape="2, 257, 512" offset="0" size="526336" />
			<output>
				<port id="0" precision="FP16" names="cst_rfft_512__56">
					<dim>2</dim>
					<dim>257</dim>
					<dim>512</dim>
				</port>
			</output>
		</layer>
		<layer id="2" name="cst_rfft_512__56" type="Convert" version="opset1">
			<data destination_type="f32" />
			<rt_info>
				<attribute name="decompression" version="0" />
			</rt_info>
			<input>
				<port id="0" precision="FP16">
					<dim>2</dim>
					<dim>257</dim>
					<dim>512</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32">
					<dim>2</dim>
					<dim>257</dim>
					<dim>512</dim>
				</port>
			</output>
		</layer>
		<layer id="3" name="StatefulPartitionedCall/yamnet_frames/tf_op_layer_ZerosLike/ZerosLike:0" type="Const" version="opset1">
			<data element_type="i32" shape="1" offset="526336" size="4" />
			<rt_info>
				<attribute name="precise" version="0" />
			</rt_info>
			<output>
				<port id="0" precision="I32" names="StatefulPartitionedCall/yamnet_frames/tf_op_layer_ZerosLike/ZerosLike:0">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="4" name="StatefulPartitionedCall/yamnet_frames/tf_op_layer_Maximum_2/Maximum_2/x:0" type="Const" version="opset1">
			<data element_type="i32" shape="" offset="526336" size="4" />
			<rt_info>
				<attribute name="precise" version="0" />
			</rt_info>
			<output>
				<port id="0" precision="I32" names="StatefulPartitionedCall/yamnet_frames/tf_op_layer_Maximum_2/Maximum_2/x:0" />
			</output>
		</layer>
		<layer id="5" name="StatefulPartitionedCall/yamnet_frames/tf_op_layer_Sub/Sub/x:0" type="Const" version="opset1">
			<data element_type="i32" shape="" offset="526340" size="4" />
			<rt_info>
				<attribute name="precise" version="0" />
			</rt_info>
			<output>
				<port id="0" precision="I32" names="StatefulPartitionedCall/yamnet_frames/tf_op_layer_Sub/Sub/x:0" />
			</output>
		</layer>
		<layer id="6" name="StatefulPartitionedCall/yamnet_frames/tf_op_layer_Shape/Shape" type="ShapeOf" version="opset3">
			<data output_type="i64" />
			<input>
				<port id="0" precision="FP32">
					<dim>-1</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="I64" names="StatefulPartitionedCall/yamnet_frames/tf_op_layer_Shape/Shape:0">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="7" name="Squeeze_30398" type="Squeeze" version="opset1">
			<input>
				<port id="0" precision="I64">
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="I64" />
			</output>
		</layer>
		<layer id="8" name="Convert_30399" type="Convert" version="opset1">
			<data destination_type="i32" />
			<input>
				<port id="0" precision="I64" />
			</input>
			<output>
				<port id="1" precision="I32" names="StatefulPartitionedCall/yamnet_frames/tf_op_layer_strided_slice/strided_slice__14:0" />
			</output>
		</layer>
		<layer id="9" name="StatefulPartitionedCall/yamnet_frames/tf_op_layer_Sub/Sub" type="Subtract" version="opset1">
			<data auto_broadcast="numpy" />
			<input>
				<port id="0" precision="I32" />
				<port id="1" precision="I32" />
			</input>
			<output>
				<port id="2" precision="I32" names="StatefulPartitionedCall/yamnet_frames/tf_op_layer_Sub/Sub:0" />
			</output>
		</layer>
		<layer id="10" name="StatefulPartitionedCall/yamnet_frames/tf_op_layer_Maximum/Maximum" type="Maximum" version="opset1">
			<data auto_broadcast="numpy" />
			<input>
				<port id="0" precision="I32" />
				<port id="1" precision="I32" />
			</input>
			<output>
				<port id="2" precision="I32" names="StatefulPartitionedCall/yamnet_frames/tf_op_layer_Maximum/Maximum:0" />
			</output>
		</layer>
		<layer id="11" name="StatefulPartitionedCall/yamnet_frames/tf_op_layer_Mul/Mul/x:0" type="Const" version="opset1">
			<data element_type="i32" shape="" offset="526344" size="4" />
			<rt_info>
				<attribute name="precise" version="0" />
			</rt_info>
			<output>
				<port id="0" precision="I32" names="StatefulPartitionedCall/yamnet_frames/tf_op_layer_Mul/Mul/x:0" />
			</output>
		</layer>
		<layer id="12" name="StatefulPartitionedCall/yamnet_frames/tf_op_layer_Maximum_1/Maximum_1" type="Maximum" version="opset1">
			<data auto_broadcast="numpy" />
			<input>
				<port id="0" precision="I32" />
				<port id="1" precision="I32" />
			</input>
			<output>
				<port id="2" precision="I32" names="StatefulPartitionedCall/yamnet_frames/tf_op_layer_Maximum_1/Maximum_1:0" />
			</output>
		</layer>
		<layer id="13" name="Constant_27071" type="Const" version="opset1">
			<data element_type="i32" shape="" offset="526348" size="4" />
			<rt_info>
				<attribute name="precise" version="0" />
			</rt_info>
			<output>
				<port id="0" precision="I32" />
			</output>
		</layer>
		<layer id="14" name="StatefulPartitionedCall/yamnet_frames/tf_op_layer_Sub_1/Sub_1" type="Add" version="opset1">
			<data auto_broadcast="numpy" />
			<input>
				<port id="0" precision="I32" />
				<port id="1" precision="I32" />
			</input>
			<output>
				<port id="2" precision="I32" names="StatefulPartitionedCall/yamnet_frames/tf_op_layer_Sub_1/Sub_1:0" />
			</output>
		</layer>
		<layer id="15" name="StatefulPartitionedCall/yamnet_frames/tf_op_layer_Cast/Cast" type="Convert" version="opset1">
			<data destination_type="f32" />
			<input>
				<port id="0" precision="I32" />
			</input>
			<output>
				<port id="1" precision="FP32" names="StatefulPartitionedCall/yamnet_frames/tf_op_layer_Cast/Cast:0" />
			</output>
		</layer>
		<layer id="16" name="ConstantFolding/StatefulPartitionedCall/yamnet_frames/tf_op_layer_RealDiv/RealDiv_recip:0" type="Const" version="opset1">
			<data element_type="f32" shape="" offset="526352" size="4" />
			<rt_info>
				<attribute name="precise" version="0" />
			</rt_info>
			<output>
				<port id="0" precision="FP32" names="ConstantFolding/StatefulPartitionedCall/yamnet_frames/tf_op_layer_RealDiv/RealDiv_recip:0" />
			</output>
		</layer>
		<layer id="17" name="StatefulPartitionedCall/yamnet_frames/tf_op_layer_RealDiv/RealDiv" type="Multiply" version="opset1">
			<data auto_broadcast="numpy" />
			<input>
				<port id="0" precision="FP32" />
				<port id="1" precision="FP32" />
			</input>
			<output>
				<port id="2" precision="FP32" names="StatefulPartitionedCall/yamnet_frames/tf_op_layer_RealDiv/RealDiv:0" />
			</output>
		</layer>
		<layer id="18" name="StatefulPartitionedCall/yamnet_frames/tf_op_layer_Ceil/Ceil" type="Ceiling" version="opset1">
			<input>
				<port id="0" precision="FP32" />
			</input>
			<output>
				<port id="1" precision="FP32" names="StatefulPartitionedCall/yamnet_frames/tf_op_layer_Ceil/Ceil:0" />
			</output>
		</layer>
		<layer id="19" name="StatefulPartitionedCall/yamnet_frames/tf_op_layer_Cast_1/Cast_1" type="Convert" version="opset1">
			<data destination_type="i32" />
			<input>
				<port id="0" precision="FP32" />
			</input>
			<output>
				<port id="1" precision="I32" names="StatefulPartitionedCall/yamnet_frames/tf_op_layer_Cast_1/Cast_1:0" />
			</output>
		</layer>
		<layer id="20" name="StatefulPartitionedCall/yamnet_frames/tf_op_layer_Mul/Mul" type="Multiply" version="opset1">
			<data auto_broadcast="numpy" />
			<input>
				<port id="0" precision="I32" />
				<port id="1" precision="I32" />
			</input>
			<output>
				<port id="2" precision="I32" names="StatefulPartitionedCall/yamnet_frames/tf_op_layer_Mul/Mul:0" />
			</output>
		</layer>
		<layer id="21" name="StatefulPartitionedCall/yamnet_frames/tf_op_layer_Sub_2/Sub_2" type="Subtract" version="opset1">
			<data auto_broadcast="numpy" />
			<input>
				<port id="0" precision="I32" />
				<port id="1" precision="I32" />
			</input>
			<output>
				<port id="2" precision="I32" names="StatefulPartitionedCall/yamnet_frames/tf_op_layer_Sub_2/Sub_2:0" />
			</output>
		</layer>
		<layer id="22" name="StatefulPartitionedCall/yamnet_frames/tf_op_layer_AddV2/AddV2" type="Add" version="opset1">
			<data auto_broadcast="numpy" />
			<input>
				<port id="0" precision="I32" />
				<port id="1" precision="I32" />
			</input>
			<output>
				<port id="2" precision="I32" names="StatefulPartitionedCall/yamnet_frames/tf_op_layer_AddV2/AddV2:0" />
			</output>
		</layer>
		<layer id="23" name="const_axes__18" type="Const" version="opset1">
			<data element_type="i64" shape="1" offset="526356" size="8" />
			<rt_info>
				<attribute name="precise" version="0" />
			</rt_info>
			<output>
				<port id="0" precision="I64" names="const_axes__18">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="24" name="StatefulPartitionedCall/yamnet_frames/tf_op_layer_Pad/paddings/0/Pad/paddings/0_Unsqueeze__19" type="Unsqueeze" version="opset1">
			<input>
				<port id="0" precision="I32" />
				<port id="1" precision="I64">
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="I32" names="StatefulPartitionedCall/yamnet_frames/tf_op_layer_Pad/paddings/0/Pad/paddings/0_Unsqueeze__19:0">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="25" name="StatefulPartitionedCall/yamnet_frames/tf_op_layer_Pad/paddings/0/Pad/paddings/0_Concat__20" type="Concat" version="opset1">
			<data axis="0" />
			<input>
				<port id="0" precision="I32">
					<dim>1</dim>
				</port>
				<port id="1" precision="I32">
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="I32" names="StatefulPartitionedCall/yamnet_frames/tf_op_layer_Pad/paddings/0/Pad/paddings/0_Concat__20:0">
					<dim>2</dim>
				</port>
			</output>
		</layer>
		<layer id="26" name="StatefulPartitionedCall/yamnet_frames/tf_op_layer_Pad/paddings/Pad/paddings" type="Unsqueeze" version="opset1">
			<input>
				<port id="0" precision="I32">
					<dim>2</dim>
				</port>
				<port id="1" precision="I64">
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="I32" names="StatefulPartitionedCall/yamnet_frames/tf_op_layer_Pad/paddings/Pad/paddings:0">
					<dim>1</dim>
					<dim>2</dim>
				</port>
			</output>
		</layer>
		<layer id="27" name="StatefulPartitionedCall/yamnet_frames/tf_op_layer_Pad/Pad__24" type="Convert" version="opset1">
			<data destination_type="i64" />
			<input>
				<port id="0" precision="I32">
					<dim>1</dim>
					<dim>2</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="I64" names="StatefulPartitionedCall/yamnet_frames/tf_op_layer_Pad/Pad__24:0">
					<dim>1</dim>
					<dim>2</dim>
				</port>
			</output>
		</layer>
		<layer id="28" name="Constant_29755" type="Const" version="opset1">
			<data element_type="i64" shape="1" offset="526364" size="8" />
			<rt_info>
				<attribute name="precise" version="0" />
			</rt_info>
			<output>
				<port id="0" precision="I64">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="29" name="StatefulPartitionedCall/yamnet_frames/tf_op_layer_Pad/Pad__27" type="Reshape" version="opset1">
			<data special_zero="false" />
			<input>
				<port id="0" precision="I64">
					<dim>1</dim>
					<dim>2</dim>
				</port>
				<port id="1" precision="I64">
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="I64" names="StatefulPartitionedCall/yamnet_frames/tf_op_layer_Pad/Pad__27:0">
					<dim>2</dim>
				</port>
			</output>
		</layer>
		<layer id="30" name="Constant_122" type="Const" version="opset1">
			<data element_type="i64" shape="" offset="526356" size="8" />
			<rt_info>
				<attribute name="precise" version="0" />
			</rt_info>
			<output>
				<port id="0" precision="I64" />
			</output>
		</layer>
		<layer id="31" name="Split_123" type="Split" version="opset1">
			<data num_splits="2" />
			<input>
				<port id="0" precision="I64">
					<dim>2</dim>
				</port>
				<port id="1" precision="I64" />
			</input>
			<output>
				<port id="2" precision="I64">
					<dim>1</dim>
				</port>
				<port id="3" precision="I64">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="32" name="Constant_121_compressed" type="Const" version="opset1">
			<data element_type="f16" shape="" offset="526372" size="2" />
			<output>
				<port id="0" precision="FP16" />
			</output>
		</layer>
		<layer id="33" name="Constant_121" type="Convert" version="opset1">
			<data destination_type="f32" />
			<rt_info>
				<attribute name="decompression" version="0" />
			</rt_info>
			<input>
				<port id="0" precision="FP16" />
			</input>
			<output>
				<port id="1" precision="FP32" />
			</output>
		</layer>
		<layer id="34" name="StatefulPartitionedCall/yamnet_frames/tf_op_layer_Pad/Pad" type="Pad" version="opset12">
			<data pad_mode="constant" />
			<input>
				<port id="0" precision="FP32">
					<dim>-1</dim>
				</port>
				<port id="1" precision="I64">
					<dim>1</dim>
				</port>
				<port id="2" precision="I64">
					<dim>1</dim>
				</port>
				<port id="3" precision="FP32" />
			</input>
			<output>
				<port id="4" precision="FP32" names="StatefulPartitionedCall/yamnet_frames/tf_op_layer_Pad/Pad:0">
					<dim>-1</dim>
				</port>
			</output>
		</layer>
		<layer id="35" name="StatefulPartitionedCall/yamnet_frames/tf_op_layer_Shape_1/Shape_1" type="ShapeOf" version="opset3">
			<data output_type="i64" />
			<input>
				<port id="0" precision="FP32">
					<dim>-1</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="I64" names="StatefulPartitionedCall/yamnet_frames/tf_op_layer_Shape_1/Shape_1:0">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="36" name="Squeeze_30414" type="Squeeze" version="opset1">
			<input>
				<port id="0" precision="I64">
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="I64" />
			</output>
		</layer>
		<layer id="37" name="Convert_30415" type="Convert" version="opset1">
			<data destination_type="i32" />
			<input>
				<port id="0" precision="I64" />
			</input>
			<output>
				<port id="1" precision="I32" names="StatefulPartitionedCall/yamnet_frames/tf_op_layer_Reshape/Reshape:0" />
			</output>
		</layer>
		<layer id="38" name="StatefulPartitionedCall/yamnet_frames/tf_op_layer_FloorDiv_1/FloorDiv_1/y:0" type="Const" version="opset1">
			<data element_type="i32" shape="" offset="526374" size="4" />
			<output>
				<port id="0" precision="I32" names="StatefulPartitionedCall/yamnet_frames/tf_op_layer_FloorDiv_1/FloorDiv_1/y:0" />
			</output>
		</layer>
		<layer id="39" name="StatefulPartitionedCall/yamnet_frames/tf_op_layer_FloorDiv_1/FloorDiv_1" type="Divide" version="opset1">
			<data auto_broadcast="numpy" m_pythondiv="true" />
			<input>
				<port id="0" precision="I32" />
				<port id="1" precision="I32" />
			</input>
			<output>
				<port id="2" precision="I32" names="StatefulPartitionedCall/yamnet_frames/tf_op_layer_FloorDiv_1/FloorDiv_1:0" />
			</output>
		</layer>
		<layer id="40" name="StatefulPartitionedCall/yamnet_frames/tf_op_layer_Mul_1/Mul_1" type="Multiply" version="opset1">
			<data auto_broadcast="numpy" />
			<input>
				<port id="0" precision="I32" />
				<port id="1" precision="I32" />
			</input>
			<output>
				<port id="2" precision="I32" names="StatefulPartitionedCall/yamnet_frames/tf_op_layer_Mul_1/Mul_1:0" />
			</output>
		</layer>
		<layer id="41" name="StatefulPartitionedCall/yamnet_frames/tf_op_layer_concat/values_1/concat/values_1" type="Unsqueeze" version="opset1">
			<input>
				<port id="0" precision="I32" />
				<port id="1" precision="I64">
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="I32" names="StatefulPartitionedCall/yamnet_frames/tf_op_layer_concat/concat:0,StatefulPartitionedCall/yamnet_frames/tf_op_layer_concat/values_1/concat/values_1:0">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="42" name="const_fold_opt__400" type="Const" version="opset1">
			<data element_type="i32" shape="1" offset="526378" size="4" />
			<output>
				<port id="0" precision="I32" names="const_fold_opt__400">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="43" name="StatefulPartitionedCall/yamnet_frames/tf_op_layer_StridedSlice/StridedSlice" type="Slice" version="opset8">
			<input>
				<port id="0" precision="FP32">
					<dim>-1</dim>
				</port>
				<port id="1" precision="I32">
					<dim>1</dim>
				</port>
				<port id="2" precision="I32">
					<dim>1</dim>
				</port>
				<port id="3" precision="I32">
					<dim>1</dim>
				</port>
				<port id="4" precision="I32">
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="5" precision="FP32" names="StatefulPartitionedCall/yamnet_frames/tf_op_layer_StridedSlice/StridedSlice:0">
					<dim>-1</dim>
				</port>
			</output>
		</layer>
		<layer id="44" name="Constant_30441" type="Const" version="opset1">
			<data element_type="i64" shape="2" offset="526382" size="16" />
			<rt_info>
				<attribute name="precise" version="0" />
			</rt_info>
			<output>
				<port id="0" precision="I64">
					<dim>2</dim>
				</port>
			</output>
		</layer>
		<layer id="45" name="StatefulPartitionedCall/yamnet_frames/tf_op_layer_Reshape_1/Reshape_1" type="Reshape" version="opset1">
			<data special_zero="true" />
			<input>
				<port id="0" precision="FP32">
					<dim>-1</dim>
				</port>
				<port id="1" precision="I64">
					<dim>2</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="StatefulPartitionedCall/yamnet_frames/tf_op_layer_Reshape_1/Reshape_1:0">
					<dim>-1</dim>
					<dim>80</dim>
				</port>
			</output>
		</layer>
		<layer id="46" name="StatefulPartitionedCall/yamnet_frames/tf_op_layer_AddV2_4/AddV2_4/x:0" type="Const" version="opset1">
			<data element_type="i32" shape="" offset="526378" size="4" />
			<output>
				<port id="0" precision="I32" names="StatefulPartitionedCall/yamnet_frames/tf_op_layer_AddV2_4/AddV2_4/x:0" />
			</output>
		</layer>
		<layer id="47" name="Constant_27075" type="Const" version="opset1">
			<data element_type="i32" shape="" offset="526398" size="4" />
			<output>
				<port id="0" precision="I32" />
			</output>
		</layer>
		<layer id="48" name="StatefulPartitionedCall/yamnet_frames/tf_op_layer_Sub_3/Sub_3" type="Add" version="opset1">
			<data auto_broadcast="numpy" />
			<input>
				<port id="0" precision="I32" />
				<port id="1" precision="I32" />
			</input>
			<output>
				<port id="2" precision="I32" names="StatefulPartitionedCall/yamnet_frames/tf_op_layer_Sub_3/Sub_3:0" />
			</output>
		</layer>
		<layer id="49" name="StatefulPartitionedCall/yamnet_frames/tf_op_layer_FloorDiv/FloorDiv/y:0" type="Const" version="opset1">
			<data element_type="i32" shape="" offset="526402" size="4" />
			<output>
				<port id="0" precision="I32" names="StatefulPartitionedCall/yamnet_frames/tf_op_layer_FloorDiv/FloorDiv/y:0" />
			</output>
		</layer>
		<layer id="50" name="StatefulPartitionedCall/yamnet_frames/tf_op_layer_FloorDiv/FloorDiv" type="Divide" version="opset1">
			<data auto_broadcast="numpy" m_pythondiv="true" />
			<input>
				<port id="0" precision="I32" />
				<port id="1" precision="I32" />
			</input>
			<output>
				<port id="2" precision="I32" names="StatefulPartitionedCall/yamnet_frames/tf_op_layer_FloorDiv/FloorDiv:0" />
			</output>
		</layer>
		<layer id="51" name="StatefulPartitionedCall/yamnet_frames/tf_op_layer_AddV2_1/AddV2_1" type="Add" version="opset1">
			<data auto_broadcast="numpy" />
			<input>
				<port id="0" precision="I32" />
				<port id="1" precision="I32" />
			</input>
			<output>
				<port id="2" precision="I32" names="StatefulPartitionedCall/yamnet_frames/tf_op_layer_AddV2_1/AddV2_1:0" />
			</output>
		</layer>
		<layer id="52" name="StatefulPartitionedCall/yamnet_frames/tf_op_layer_Maximum_2/Maximum_2" type="Maximum" version="opset1">
			<data auto_broadcast="numpy" />
			<input>
				<port id="0" precision="I32" />
				<port id="1" precision="I32" />
			</input>
			<output>
				<port id="2" precision="I32" names="StatefulPartitionedCall/yamnet_frames/tf_op_layer_Maximum_2/Maximum_2:0" />
			</output>
		</layer>
		<layer id="53" name="StatefulPartitionedCall/yamnet_frames/tf_op_layer_Range/Range" type="Range" version="opset4">
			<data output_type="i32" />
			<input>
				<port id="0" precision="I32" />
				<port id="1" precision="I32" />
				<port id="2" precision="I32" />
			</input>
			<output>
				<port id="3" precision="I32" names="StatefulPartitionedCall/yamnet_frames/tf_op_layer_Range/Range:0">
					<dim>-1</dim>
				</port>
			</output>
		</layer>
		<layer id="54" name="Constant_27603" type="Const" version="opset1">
			<data element_type="i32" shape="1" offset="526406" size="4" />
			<output>
				<port id="0" precision="I32">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="55" name="StatefulPartitionedCall/yamnet_frames/tf_op_layer_Mul_2/Mul_2" type="Multiply" version="opset1">
			<data auto_broadcast="numpy" />
			<input>
				<port id="0" precision="I32">
					<dim>-1</dim>
				</port>
				<port id="1" precision="I32">
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="I32" names="StatefulPartitionedCall/yamnet_frames/tf_op_layer_Mul_2/Mul_2:0">
					<dim>-1</dim>
				</port>
			</output>
		</layer>
		<layer id="56" name="Constant_30442" type="Const" version="opset1">
			<data element_type="i64" shape="2" offset="526410" size="16" />
			<rt_info>
				<attribute name="precise" version="0" />
			</rt_info>
			<output>
				<port id="0" precision="I64">
					<dim>2</dim>
				</port>
			</output>
		</layer>
		<layer id="57" name="StatefulPartitionedCall/yamnet_frames/tf_op_layer_Reshape_2/Reshape_2" type="Reshape" version="opset1">
			<data special_zero="true" />
			<input>
				<port id="0" precision="I32">
					<dim>-1</dim>
				</port>
				<port id="1" precision="I64">
					<dim>2</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="I32" names="StatefulPartitionedCall/yamnet_frames/tf_op_layer_Reshape_2/Reshape_2:0">
					<dim>-1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="58" name="StatefulPartitionedCall/yamnet_frames/tf_op_layer_AddV2_2/AddV2_2/y:0" type="Const" version="opset1">
			<data element_type="i32" shape="1, 5" offset="526426" size="20" />
			<output>
				<port id="0" precision="I32" names="StatefulPartitionedCall/yamnet_frames/tf_op_layer_AddV2_2/AddV2_2/y:0">
					<dim>1</dim>
					<dim>5</dim>
				</port>
			</output>
		</layer>
		<layer id="59" name="StatefulPartitionedCall/yamnet_frames/tf_op_layer_AddV2_2/AddV2_2" type="Add" version="opset1">
			<data auto_broadcast="numpy" />
			<input>
				<port id="0" precision="I32">
					<dim>-1</dim>
					<dim>1</dim>
				</port>
				<port id="1" precision="I32">
					<dim>1</dim>
					<dim>5</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="I32" names="StatefulPartitionedCall/yamnet_frames/tf_op_layer_AddV2_2/AddV2_2:0">
					<dim>-1</dim>
					<dim>5</dim>
				</port>
			</output>
		</layer>
		<layer id="60" name="Constant_1401" type="Const" version="opset1">
			<data element_type="i64" shape="" offset="526356" size="8" />
			<output>
				<port id="0" precision="I64" />
			</output>
		</layer>
		<layer id="61" name="StatefulPartitionedCall/yamnet_frames/tf_op_layer_GatherV2/GatherV2" type="Gather" version="opset8">
			<data batch_dims="0" />
			<input>
				<port id="0" precision="FP32">
					<dim>-1</dim>
					<dim>80</dim>
				</port>
				<port id="1" precision="I32">
					<dim>-1</dim>
					<dim>5</dim>
				</port>
				<port id="2" precision="I64" />
			</input>
			<output>
				<port id="3" precision="FP32" names="StatefulPartitionedCall/yamnet_frames/tf_op_layer_GatherV2/GatherV2:0">
					<dim>-1</dim>
					<dim>5</dim>
					<dim>80</dim>
				</port>
			</output>
		</layer>
		<layer id="62" name="Constant_30443" type="Const" version="opset1">
			<data element_type="i64" shape="2" offset="526446" size="16" />
			<rt_info>
				<attribute name="precise" version="0" />
			</rt_info>
			<output>
				<port id="0" precision="I64">
					<dim>2</dim>
				</port>
			</output>
		</layer>
		<layer id="63" name="StatefulPartitionedCall/yamnet_frames/tf_op_layer_Reshape_3/Reshape_3" type="Reshape" version="opset1">
			<data special_zero="true" />
			<input>
				<port id="0" precision="FP32">
					<dim>-1</dim>
					<dim>5</dim>
					<dim>80</dim>
				</port>
				<port id="1" precision="I64">
					<dim>2</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="StatefulPartitionedCall/yamnet_frames/tf_op_layer_Reshape_3/Reshape_3:0">
					<dim>-1</dim>
					<dim>400</dim>
				</port>
			</output>
		</layer>
		<layer id="64" name="Constant_27604_compressed" type="Const" version="opset1">
			<data element_type="f16" shape="1, 400" offset="526462" size="800" />
			<output>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>400</dim>
				</port>
			</output>
		</layer>
		<layer id="65" name="Constant_27604" type="Convert" version="opset1">
			<data destination_type="f32" />
			<rt_info>
				<attribute name="decompression" version="0" />
			</rt_info>
			<input>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>400</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>400</dim>
				</port>
			</output>
		</layer>
		<layer id="66" name="StatefulPartitionedCall/yamnet_frames/tf_op_layer_Mul_3/Mul_3" type="Multiply" version="opset1">
			<data auto_broadcast="numpy" />
			<input>
				<port id="0" precision="FP32">
					<dim>-1</dim>
					<dim>400</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>400</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="StatefulPartitionedCall/yamnet_frames/tf_op_layer_Mul_3/Mul_3:0">
					<dim>-1</dim>
					<dim>400</dim>
				</port>
			</output>
		</layer>
		<layer id="67" name="Constant_1638" type="Const" version="opset1">
			<data element_type="i64" shape="2" offset="527262" size="16" />
			<rt_info>
				<attribute name="precise" version="0" />
			</rt_info>
			<output>
				<port id="0" precision="I64">
					<dim>2</dim>
				</port>
			</output>
		</layer>
		<layer id="68" name="Constant_1639" type="Const" version="opset1">
			<data element_type="i64" shape="2" offset="527278" size="16" />
			<rt_info>
				<attribute name="precise" version="0" />
			</rt_info>
			<output>
				<port id="0" precision="I64">
					<dim>2</dim>
				</port>
			</output>
		</layer>
		<layer id="69" name="Constant_1637_compressed" type="Const" version="opset1">
			<data element_type="f16" shape="" offset="526372" size="2" />
			<output>
				<port id="0" precision="FP16" />
			</output>
		</layer>
		<layer id="70" name="Constant_1637" type="Convert" version="opset1">
			<data destination_type="f32" />
			<rt_info>
				<attribute name="decompression" version="0" />
			</rt_info>
			<input>
				<port id="0" precision="FP16" />
			</input>
			<output>
				<port id="1" precision="FP32" />
			</output>
		</layer>
		<layer id="71" name="StatefulPartitionedCall/yamnet_frames/tf_op_layer_Pad_1/Pad_1" type="Pad" version="opset12">
			<data pad_mode="constant" />
			<input>
				<port id="0" precision="FP32">
					<dim>-1</dim>
					<dim>400</dim>
				</port>
				<port id="1" precision="I64">
					<dim>2</dim>
				</port>
				<port id="2" precision="I64">
					<dim>2</dim>
				</port>
				<port id="3" precision="FP32" />
			</input>
			<output>
				<port id="4" precision="FP32" names="StatefulPartitionedCall/yamnet_frames/tf_op_layer_Pad_1/Pad_1:0">
					<dim>-1</dim>
					<dim>512</dim>
				</port>
			</output>
		</layer>
		<layer id="72" name="CPLX_M_StatefulPartitionedCall/yamnet_frames/tf_op_layer_RFFT/RFFTrfft__59" type="MatMul" version="opset1">
			<data transpose_a="false" transpose_b="true" />
			<input>
				<port id="0" precision="FP32">
					<dim>2</dim>
					<dim>257</dim>
					<dim>512</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>-1</dim>
					<dim>512</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="CPLX_M_StatefulPartitionedCall/yamnet_frames/tf_op_layer_RFFT/RFFTrfft__59:0">
					<dim>2</dim>
					<dim>257</dim>
					<dim>-1</dim>
				</port>
			</output>
		</layer>
		<layer id="73" name="Constant_1644" type="Const" version="opset1">
			<data element_type="i64" shape="3" offset="527294" size="24" />
			<output>
				<port id="0" precision="I64">
					<dim>3</dim>
				</port>
			</output>
		</layer>
		<layer id="74" name="CPLX_T_StatefulPartitionedCall/yamnet_frames/tf_op_layer_RFFT/RFFTrfft__61" type="Transpose" version="opset1">
			<input>
				<port id="0" precision="FP32">
					<dim>2</dim>
					<dim>257</dim>
					<dim>-1</dim>
				</port>
				<port id="1" precision="I64">
					<dim>3</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="CPLX_T_StatefulPartitionedCall/yamnet_frames/tf_op_layer_RFFT/RFFTrfft__61:0">
					<dim>2</dim>
					<dim>-1</dim>
					<dim>257</dim>
				</port>
			</output>
		</layer>
		<layer id="75" name="Constant_1646" type="Const" version="opset1">
			<data element_type="i64" shape="" offset="526356" size="8" />
			<output>
				<port id="0" precision="I64" />
			</output>
		</layer>
		<layer id="76" name="Real_StatefulPartitionedCall/yamnet_frames/tf_op_layer_ComplexAbs/ComplexAbs__66" type="Gather" version="opset8">
			<data batch_dims="0" />
			<input>
				<port id="0" precision="FP32">
					<dim>2</dim>
					<dim>-1</dim>
					<dim>257</dim>
				</port>
				<port id="1" precision="I64">
					<dim>1</dim>
				</port>
				<port id="2" precision="I64" />
			</input>
			<output>
				<port id="3" precision="FP32" names="Real_StatefulPartitionedCall/yamnet_frames/tf_op_layer_ComplexAbs/ComplexAbs__66:0">
					<dim>1</dim>
					<dim>-1</dim>
					<dim>257</dim>
				</port>
			</output>
		</layer>
		<layer id="77" name="Constant_27605_compressed" type="Const" version="opset1">
			<data element_type="f16" shape="1, 1, 1" offset="527318" size="2" />
			<output>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="78" name="Constant_27605" type="Convert" version="opset1">
			<data destination_type="f32" />
			<rt_info>
				<attribute name="decompression" version="0" />
			</rt_info>
			<input>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="79" name="Real_StatefulPartitionedCall/yamnet_frames/tf_op_layer_ComplexAbs/ComplexAbs__66p2p__70" type="Power" version="opset1">
			<data auto_broadcast="numpy" />
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>-1</dim>
					<dim>257</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="Real_StatefulPartitionedCall/yamnet_frames/tf_op_layer_ComplexAbs/ComplexAbs__66p2p__70:0">
					<dim>1</dim>
					<dim>-1</dim>
					<dim>257</dim>
				</port>
			</output>
		</layer>
		<layer id="80" name="const_ends__109" type="Const" version="opset1">
			<data element_type="i64" shape="1" offset="527320" size="8" />
			<output>
				<port id="0" precision="I64" names="const_ends__109">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="81" name="Constant_1649" type="Const" version="opset1">
			<data element_type="i64" shape="" offset="526356" size="8" />
			<output>
				<port id="0" precision="I64" />
			</output>
		</layer>
		<layer id="82" name="Imag_StatefulPartitionedCall/yamnet_frames/tf_op_layer_ComplexAbs/ComplexAbs__68" type="Gather" version="opset8">
			<data batch_dims="0" />
			<input>
				<port id="0" precision="FP32">
					<dim>2</dim>
					<dim>-1</dim>
					<dim>257</dim>
				</port>
				<port id="1" precision="I64">
					<dim>1</dim>
				</port>
				<port id="2" precision="I64" />
			</input>
			<output>
				<port id="3" precision="FP32" names="Imag_StatefulPartitionedCall/yamnet_frames/tf_op_layer_ComplexAbs/ComplexAbs__68:0">
					<dim>1</dim>
					<dim>-1</dim>
					<dim>257</dim>
				</port>
			</output>
		</layer>
		<layer id="83" name="Constant_27606_compressed" type="Const" version="opset1">
			<data element_type="f16" shape="1, 1, 1" offset="527318" size="2" />
			<output>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="84" name="Constant_27606" type="Convert" version="opset1">
			<data destination_type="f32" />
			<rt_info>
				<attribute name="decompression" version="0" />
			</rt_info>
			<input>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="85" name="Imag_StatefulPartitionedCall/yamnet_frames/tf_op_layer_ComplexAbs/ComplexAbs__68p2p__72" type="Power" version="opset1">
			<data auto_broadcast="numpy" />
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>-1</dim>
					<dim>257</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="Imag_StatefulPartitionedCall/yamnet_frames/tf_op_layer_ComplexAbs/ComplexAbs__68p2p__72:0">
					<dim>1</dim>
					<dim>-1</dim>
					<dim>257</dim>
				</port>
			</output>
		</layer>
		<layer id="86" name="ComplexAbs_StatefulPartitionedCall/yamnet_frames/tf_op_layer_ComplexAbs/ComplexAbs__74" type="Add" version="opset1">
			<data auto_broadcast="numpy" />
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>-1</dim>
					<dim>257</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>-1</dim>
					<dim>257</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="ComplexAbs_StatefulPartitionedCall/yamnet_frames/tf_op_layer_ComplexAbs/ComplexAbs__74:0">
					<dim>1</dim>
					<dim>-1</dim>
					<dim>257</dim>
				</port>
			</output>
		</layer>
		<layer id="87" name="ComplexAbsStatefulPartitionedCall/yamnet_frames/tf_op_layer_ComplexAbs/ComplexAbs__77" type="Squeeze" version="opset1">
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>-1</dim>
					<dim>257</dim>
				</port>
				<port id="1" precision="I64">
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="ComplexAbsStatefulPartitionedCall/yamnet_frames/tf_op_layer_ComplexAbs/ComplexAbs__77:0">
					<dim>-1</dim>
					<dim>257</dim>
				</port>
			</output>
		</layer>
		<layer id="88" name="ComplexAbsStatefulPartitionedCall/yamnet_frames/tf_op_layer_ComplexAbs/ComplexAbs__80" type="Sqrt" version="opset1">
			<input>
				<port id="0" precision="FP32">
					<dim>-1</dim>
					<dim>257</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32" names="ComplexAbsStatefulPartitionedCall/yamnet_frames/tf_op_layer_ComplexAbs/ComplexAbs__80:0">
					<dim>-1</dim>
					<dim>257</dim>
				</port>
			</output>
		</layer>
		<layer id="89" name="Transpose_22690_compressed" type="Const" version="opset1">
			<data element_type="f16" shape="64, 257" offset="527328" size="32896" />
			<output>
				<port id="0" precision="FP16">
					<dim>64</dim>
					<dim>257</dim>
				</port>
			</output>
		</layer>
		<layer id="90" name="Transpose_22690" type="Convert" version="opset1">
			<data destination_type="f32" />
			<rt_info>
				<attribute name="decompression" version="0" />
			</rt_info>
			<input>
				<port id="0" precision="FP16">
					<dim>64</dim>
					<dim>257</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32">
					<dim>64</dim>
					<dim>257</dim>
				</port>
			</output>
		</layer>
		<layer id="91" name="StatefulPartitionedCall/yamnet_frames/tf_op_layer_MatMul/MatMul" type="MatMul" version="opset1">
			<data transpose_a="false" transpose_b="true" />
			<input>
				<port id="0" precision="FP32">
					<dim>-1</dim>
					<dim>257</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>64</dim>
					<dim>257</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="StatefulPartitionedCall/yamnet_frames/tf_op_layer_MatMul/MatMul:0">
					<dim>-1</dim>
					<dim>64</dim>
				</port>
			</output>
		</layer>
		<layer id="92" name="Constant_27607_compressed" type="Const" version="opset1">
			<data element_type="f16" shape="1, 1" offset="560224" size="2" />
			<output>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="93" name="Constant_27607" type="Convert" version="opset1">
			<data destination_type="f32" />
			<rt_info>
				<attribute name="decompression" version="0" />
			</rt_info>
			<input>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="94" name="StatefulPartitionedCall/yamnet_frames/tf_op_layer_AddV2_3/AddV2_3" type="Add" version="opset1">
			<data auto_broadcast="numpy" />
			<input>
				<port id="0" precision="FP32">
					<dim>-1</dim>
					<dim>64</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="StatefulPartitionedCall/yamnet_frames/tf_op_layer_AddV2_3/AddV2_3:0">
					<dim>-1</dim>
					<dim>64</dim>
				</port>
			</output>
		</layer>
		<layer id="95" name="output_2" type="Log" version="opset1">
			<input>
				<port id="0" precision="FP32">
					<dim>-1</dim>
					<dim>64</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32" names="output_2">
					<dim>-1</dim>
					<dim>64</dim>
				</port>
			</output>
		</layer>
		<layer id="97" name="StatefulPartitionedCall/yamnet_frames/tf_op_layer_ZerosLike_1/ZerosLike_1:0" type="Const" version="opset1">
			<data element_type="i32" shape="2" offset="526356" size="8" />
			<output>
				<port id="0" precision="I32" names="StatefulPartitionedCall/yamnet_frames/tf_op_layer_ZerosLike_1/ZerosLike_1:0">
					<dim>2</dim>
				</port>
			</output>
		</layer>
		<layer id="98" name="ShapeOf_30425" type="ShapeOf" version="opset3">
			<data output_type="i32" />
			<input>
				<port id="0" precision="FP32">
					<dim>-1</dim>
					<dim>64</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="I32">
					<dim>2</dim>
				</port>
			</output>
		</layer>
		<layer id="99" name="Constant_30426" type="Const" version="opset1">
			<data element_type="i64" shape="1" offset="526356" size="8" />
			<output>
				<port id="0" precision="I64">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="100" name="Constant_30427" type="Const" version="opset1">
			<data element_type="i64" shape="" offset="526356" size="8" />
			<output>
				<port id="0" precision="I64" />
			</output>
		</layer>
		<layer id="101" name="Gather_30428" type="Gather" version="opset8">
			<data batch_dims="0" />
			<input>
				<port id="0" precision="I32">
					<dim>2</dim>
				</port>
				<port id="1" precision="I64">
					<dim>1</dim>
				</port>
				<port id="2" precision="I64" />
			</input>
			<output>
				<port id="3" precision="I32" names="StatefulPartitionedCall/yamnet_frames/tf_op_layer_split_1/split_1:1">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="102" name="Squeeze_30431" type="Squeeze" version="opset1">
			<input>
				<port id="0" precision="I32">
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="I32" names="StatefulPartitionedCall/yamnet_frames/tf_op_layer_Reshape_4/Reshape_4:0" />
			</output>
		</layer>
		<layer id="103" name="StatefulPartitionedCall/yamnet_frames/tf_op_layer_FloorDiv_2/FloorDiv_2/y:0" type="Const" version="opset1">
			<data element_type="i32" shape="" offset="560226" size="4" />
			<output>
				<port id="0" precision="I32" names="StatefulPartitionedCall/yamnet_frames/tf_op_layer_FloorDiv_2/FloorDiv_2/y:0" />
			</output>
		</layer>
		<layer id="104" name="StatefulPartitionedCall/yamnet_frames/tf_op_layer_FloorDiv_3/FloorDiv_3" type="Divide" version="opset1">
			<data auto_broadcast="numpy" m_pythondiv="true" />
			<input>
				<port id="0" precision="I32" />
				<port id="1" precision="I32" />
			</input>
			<output>
				<port id="2" precision="I32" names="StatefulPartitionedCall/yamnet_frames/tf_op_layer_FloorDiv_3/FloorDiv_3:0" />
			</output>
		</layer>
		<layer id="105" name="StatefulPartitionedCall/yamnet_frames/tf_op_layer_Mul_4/Mul_4" type="Multiply" version="opset1">
			<data auto_broadcast="numpy" />
			<input>
				<port id="0" precision="I32" />
				<port id="1" precision="I32" />
			</input>
			<output>
				<port id="2" precision="I32" names="StatefulPartitionedCall/yamnet_frames/tf_op_layer_Mul_4/Mul_4:0" />
			</output>
		</layer>
		<layer id="106" name="StatefulPartitionedCall/yamnet_frames/tf_op_layer_concat_3/values_1/concat_3/values_1" type="Unsqueeze" version="opset1">
			<input>
				<port id="0" precision="I32" />
				<port id="1" precision="I64">
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="I32" names="StatefulPartitionedCall/yamnet_frames/tf_op_layer_concat_3/values_1/concat_3/values_1:0">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="107" name="StatefulPartitionedCall/yamnet_frames/tf_op_layer_Shape_3/Shape_3" type="ShapeOf" version="opset3">
			<data output_type="i64" />
			<input>
				<port id="0" precision="FP32">
					<dim>-1</dim>
					<dim>64</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="I64" names="StatefulPartitionedCall/yamnet_frames/tf_op_layer_Shape_3/Shape_3:0">
					<dim>2</dim>
				</port>
			</output>
		</layer>
		<layer id="108" name="Convert_30424" type="Convert" version="opset1">
			<data destination_type="i32" />
			<input>
				<port id="0" precision="I64">
					<dim>2</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="I32" names="StatefulPartitionedCall/yamnet_frames/tf_op_layer_Shape_3/Shape_3__82:0">
					<dim>2</dim>
				</port>
			</output>
		</layer>
		<layer id="109" name="Constant_1660" type="Const" version="opset1">
			<data element_type="i64" shape="" offset="526356" size="8" />
			<output>
				<port id="0" precision="I64" />
			</output>
		</layer>
		<layer id="110" name="split__83" type="Const" version="opset1">
			<data element_type="i64" shape="3" offset="560230" size="24" />
			<output>
				<port id="0" precision="I64" names="split__83">
					<dim>3</dim>
				</port>
			</output>
		</layer>
		<layer id="111" name="StatefulPartitionedCall/yamnet_frames/tf_op_layer_split_1/split_1" type="VariadicSplit" version="opset1">
			<input>
				<port id="0" precision="I32">
					<dim>2</dim>
				</port>
				<port id="1" precision="I64" />
				<port id="2" precision="I64">
					<dim>3</dim>
				</port>
			</input>
			<output>
				<port id="3" precision="I32" names="StatefulPartitionedCall/yamnet_frames/tf_op_layer_split_1/split_1:0">
					<dim>0</dim>
				</port>
				<port id="4" precision="I32" names="StatefulPartitionedCall/yamnet_frames/tf_op_layer_split_1/split_1_1:1">
					<dim>1</dim>
				</port>
				<port id="5" precision="I32" names="StatefulPartitionedCall/yamnet_frames/tf_op_layer_split_1/split_1:2">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="112" name="StatefulPartitionedCall/yamnet_frames/tf_op_layer_concat_3/concat_3" type="Concat" version="opset1">
			<data axis="0" />
			<input>
				<port id="0" precision="I32">
					<dim>1</dim>
				</port>
				<port id="1" precision="I32">
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="I32" names="StatefulPartitionedCall/yamnet_frames/tf_op_layer_concat_3/concat_3:0">
					<dim>2</dim>
				</port>
			</output>
		</layer>
		<layer id="113" name="StatefulPartitionedCall/yamnet_frames/tf_op_layer_Fill_1/Fill_1:0" type="Const" version="opset1">
			<data element_type="i32" shape="2" offset="560254" size="8" />
			<output>
				<port id="0" precision="I32" names="StatefulPartitionedCall/yamnet_frames/tf_op_layer_Fill_1/Fill_1:0">
					<dim>2</dim>
				</port>
			</output>
		</layer>
		<layer id="114" name="slice_axes__104" type="Const" version="opset1">
			<data element_type="i32" shape="2" offset="560262" size="8" />
			<output>
				<port id="0" precision="I32" names="slice_axes__104">
					<dim>2</dim>
				</port>
			</output>
		</layer>
		<layer id="115" name="StatefulPartitionedCall/yamnet_frames/tf_op_layer_StridedSlice_1/StridedSlice_1" type="Slice" version="opset8">
			<input>
				<port id="0" precision="FP32">
					<dim>-1</dim>
					<dim>64</dim>
				</port>
				<port id="1" precision="I32">
					<dim>2</dim>
				</port>
				<port id="2" precision="I32">
					<dim>2</dim>
				</port>
				<port id="3" precision="I32">
					<dim>2</dim>
				</port>
				<port id="4" precision="I32">
					<dim>2</dim>
				</port>
			</input>
			<output>
				<port id="5" precision="FP32" names="StatefulPartitionedCall/yamnet_frames/tf_op_layer_StridedSlice_1/StridedSlice_1:0">
					<dim>-1</dim>
					<dim>64</dim>
				</port>
			</output>
		</layer>
		<layer id="116" name="Constant_30444" type="Const" version="opset1">
			<data element_type="i64" shape="3" offset="560270" size="24" />
			<rt_info>
				<attribute name="precise" version="0" />
			</rt_info>
			<output>
				<port id="0" precision="I64">
					<dim>3</dim>
				</port>
			</output>
		</layer>
		<layer id="117" name="StatefulPartitionedCall/yamnet_frames/tf_op_layer_Reshape_5/Reshape_5" type="Reshape" version="opset1">
			<data special_zero="true" />
			<input>
				<port id="0" precision="FP32">
					<dim>-1</dim>
					<dim>64</dim>
				</port>
				<port id="1" precision="I64">
					<dim>3</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="StatefulPartitionedCall/yamnet_frames/tf_op_layer_Reshape_5/Reshape_5:0">
					<dim>-1</dim>
					<dim>48</dim>
					<dim>64</dim>
				</port>
			</output>
		</layer>
		<layer id="118" name="Constant_27079" type="Const" version="opset1">
			<data element_type="i32" shape="" offset="560294" size="4" />
			<output>
				<port id="0" precision="I32" />
			</output>
		</layer>
		<layer id="119" name="StatefulPartitionedCall/yamnet_frames/tf_op_layer_Sub_4/Sub_4" type="Add" version="opset1">
			<data auto_broadcast="numpy" />
			<input>
				<port id="0" precision="I32" />
				<port id="1" precision="I32" />
			</input>
			<output>
				<port id="2" precision="I32" names="StatefulPartitionedCall/yamnet_frames/tf_op_layer_Sub_4/Sub_4:0" />
			</output>
		</layer>
		<layer id="120" name="StatefulPartitionedCall/yamnet_frames/tf_op_layer_FloorDiv_2/FloorDiv_2" type="Divide" version="opset1">
			<data auto_broadcast="numpy" m_pythondiv="true" />
			<input>
				<port id="0" precision="I32" />
				<port id="1" precision="I32" />
			</input>
			<output>
				<port id="2" precision="I32" names="StatefulPartitionedCall/yamnet_frames/tf_op_layer_FloorDiv_2/FloorDiv_2:0" />
			</output>
		</layer>
		<layer id="121" name="StatefulPartitionedCall/yamnet_frames/tf_op_layer_AddV2_4/AddV2_4" type="Add" version="opset1">
			<data auto_broadcast="numpy" />
			<input>
				<port id="0" precision="I32" />
				<port id="1" precision="I32" />
			</input>
			<output>
				<port id="2" precision="I32" names="StatefulPartitionedCall/yamnet_frames/tf_op_layer_AddV2_4/AddV2_4:0" />
			</output>
		</layer>
		<layer id="122" name="StatefulPartitionedCall/yamnet_frames/tf_op_layer_Maximum_3/Maximum_3" type="Maximum" version="opset1">
			<data auto_broadcast="numpy" />
			<input>
				<port id="0" precision="I32" />
				<port id="1" precision="I32" />
			</input>
			<output>
				<port id="2" precision="I32" names="StatefulPartitionedCall/yamnet_frames/tf_op_layer_Maximum_3/Maximum_3:0" />
			</output>
		</layer>
		<layer id="123" name="StatefulPartitionedCall/yamnet_frames/tf_op_layer_Range_1/Range_1" type="Range" version="opset4">
			<data output_type="i32" />
			<input>
				<port id="0" precision="I32" />
				<port id="1" precision="I32" />
				<port id="2" precision="I32" />
			</input>
			<output>
				<port id="3" precision="I32" names="StatefulPartitionedCall/yamnet_frames/tf_op_layer_Range_1/Range_1:0">
					<dim>-1</dim>
				</port>
			</output>
		</layer>
		<layer id="124" name="Constant_30445" type="Const" version="opset1">
			<data element_type="i64" shape="2" offset="526410" size="16" />
			<rt_info>
				<attribute name="precise" version="0" />
			</rt_info>
			<output>
				<port id="0" precision="I64">
					<dim>2</dim>
				</port>
			</output>
		</layer>
		<layer id="125" name="StatefulPartitionedCall/yamnet_frames/tf_op_layer_Reshape_6/Reshape_6" type="Reshape" version="opset1">
			<data special_zero="true" />
			<input>
				<port id="0" precision="I32">
					<dim>-1</dim>
				</port>
				<port id="1" precision="I64">
					<dim>2</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="I32" names="StatefulPartitionedCall/yamnet_frames/tf_op_layer_Reshape_6/Reshape_6:0">
					<dim>-1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="126" name="StatefulPartitionedCall/yamnet_frames/tf_op_layer_AddV2_5/AddV2_5/y:0" type="Const" version="opset1">
